In [38]:
import pandas as pd

In [39]:
import numpy as np

In [10]:
world = pd.read_csv('world_cities.csv')

In [11]:
world

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [13]:
world['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [18]:
world['City / Urban area'].describe()

count         249
unique        249
top       Goiania
freq            1
Name: City / Urban area, dtype: object

In [33]:
world['calc'] = world['Population']/world['Land area (in sqKm)']

In [37]:
world.sort_values(by ='calc')

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),calc
196,197,Barnstable Town,USA,244000,741,329.284750
220,221,Hickory,USA,188000,546,344.322344
57,57,Pau,France,181000,450,402.222222
223,224,Asheville,USA,222000,536,414.179104
194,195,Chattanooga,USA,344000,751,458.055925
...,...,...,...,...,...,...
34,34,Shenzhen,China,8000000,466,17167.381974
99,99,Lagos,Nigeria,13400000,738,18157.181572
101,101,Karachi,Pakistan,9800000,518,18918.918919
74,74,Kolkata,India,12700000,531,23917.137476
75,75,Mumbai,India,14350000,484,29648.760331

In [45]:
count = world['Country'].value_counts()

In [46]:
count

USA         105
France       15
Brazil       10
Canada        9
Germany       8
           ...
Ecuador       1
Thailand      1
Egypt         1
Israel        1
Austria       1
Name: Country, Length: 61, dtype: int64

In [48]:
count[count == 4]

Italy    4
Name: Country, dtype: int64